# Pandas Missing Data & Group by

In [1]:
import numpy as np
import pandas as pd

In [10]:
df = pd.DataFrame({"A":[1,2,np.nan],
                   "B":[5,np.nan,np.nan],
                   "C":[1,2,3]})

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [8]:
df.fillna(value= df['C'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  2.0  2
2  2.0  2.0  3

In [36]:
df.loc[2].fillna(value = df['C'].mean())

C:\Users\Admin\AppData\Local\Temp\ipykernel_10996\3003982414.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.loc[2].fillna(value = df['C'].mean(),inplace = True)

In [39]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

# Groupby in Pandas

In [55]:
data = {"Company":['GOOG','GOOG','TWTR','TSLA','META','AMZN','TWTR','TSLA','META','AMZN'],
        "Employee":['Sundar','Larry','Elon','Musk','Mark','Jeff','Jack','Bryan','Chris','Vincent'],
        "Sales":[300,180,450,380,270,410,210,350,260,420]}

In [56]:
df = pd.DataFrame(data)

In [57]:
df

  Company Employee  Sales
0    GOOG   Sundar    300
1    GOOG    Larry    180
2    TWTR     Elon    450
3    TSLA     Musk    380
4    META     Mark    270
5    AMZN     Jeff    410
6    TWTR     Jack    210
7    TSLA    Bryan    350
8    META    Chris    260
9    AMZN  Vincent    420

In [58]:
x = df.groupby('Company')

In [59]:
x.sum()

C:\Users\Admin\AppData\Local\Temp\ipykernel_10996\2925620302.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  x.sum()

         Sales
Company
AMZN       830
GOOG       480
META       530
TSLA       730
TWTR       660

In [60]:
x.mean()

C:\Users\Admin\AppData\Local\Temp\ipykernel_10996\3791599204.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  x.mean()

         Sales
Company
AMZN     415.0
GOOG     240.0
META     265.0
TSLA     365.0
TWTR     330.0

In [61]:
x.median()

C:\Users\Admin\AppData\Local\Temp\ipykernel_10996\2012539586.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.median is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  x.median()

         Sales
Company
AMZN     415.0
GOOG     240.0
META     265.0
TSLA     365.0
TWTR     330.0

In [62]:
x.min()

        Employee  Sales
Company
AMZN        Jeff    410
GOOG       Larry    180
META       Chris    260
TSLA       Bryan    350
TWTR        Elon    210

In [52]:
x.max()

        Employee  Sales
Company
AMZN        Jeff    410
GOOG      Sundar    300
META        Mark    270
TSLA        Musk    380
TWTR        Elon    450

In [63]:
x.std()

C:\Users\Admin\AppData\Local\Temp\ipykernel_10996\2178744708.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  x.std()

              Sales
Company
AMZN       7.071068
GOOG      84.852814
META       7.071068
TSLA      21.213203
TWTR     169.705627

In [64]:
x.count()

         Employee  Sales
Company
AMZN            2      2
GOOG            2      2
META            2      2
TSLA            2      2
TWTR            2      2

In [65]:
x.describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
AMZN      2.0  415.0    7.071068  410.0  412.5  415.0  417.5  420.0
GOOG      2.0  240.0   84.852814  180.0  210.0  240.0  270.0  300.0
META      2.0  265.0    7.071068  260.0  262.5  265.0  267.5  270.0
TSLA      2.0  365.0   21.213203  350.0  357.5  365.0  372.5  380.0
TWTR      2.0  330.0  169.705627  210.0  270.0  330.0  390.0  450.0